In [14]:
import psycopg2
import pandas as pd

In [38]:
conn = psycopg2.connect("host=raja.db.elephantsql.com dbname=anztucof user=anztucof password=aQS9lTdUITEytNHZe8JNmrAabfKeC5H1")

In [39]:
cur = conn.cursor()

In [17]:
df = pd.read_csv('titanic.csv')

In [18]:
df.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

In [19]:
df.tail()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
882,0,2,Rev. Juozas Montvila,male,27.0,0,0,13.00
883,1,1,Miss. Margaret Edith Graham,female,19.0,0,0,30.00
884,0,3,Miss. Catherine Helen Johnston,female,7.0,1,2,23.45
885,1,1,Mr. Karl Howell Behr,male,26.0,0,0,30.00
886,0,3,Mr. Patrick Dooley,male,32.0,0,0,7.75

In [20]:
#cur.execute("CREATE TABLE test (id serial PRIMARY KEY, num integer, data varchar);")

cur.execute(
    """CREATE TABLE passenger (id serial PRIMARY KEY, name TEXT NOT NULL, sex TEXT NOT NULL, age INTEGER NOT NULL, survived INTEGER NOT NULL)"""
)
conn.commit()

In [40]:
cur.execute(
    """CREATE TABLE ticket (id serial PRIMARY KEY, passenger_id serial, pclass INTEGER NOT NULL, fare DECIMAL NOT NULL, FOREIGN KEY (passenger_id) REFERENCES passenger (id))"""
)
conn.commit()

In [41]:
# INSERT INTO some_table (an_int, a_date, a_string)
# VALUES (10, '2005-11-18', 'O''Reilly');
name="Dwight Churchill"
sex="male"
cur.execute(
    "INSERT INTO passenger (id, name, sex, age, survived) "
    "VALUES ({},{},{},{},{})".format(6969, 'Dwight Churchill', 'male', 29, 0)
)
conn.commit()

ProgrammingError: syntax error at or near "Churchill"
LINE 1: ...id, name, sex, age, survived) VALUES (6969,Dwight Churchill,...
                                                             ^